given a dataframe
filter it by student_id = 101
want to return the columns: name and age

In [11]:
student_data = [
    [101, 'Ulysses', 13],
    [53, 'William', 10],
    [128, 'Henry', 6],
    [3, 'Henry', 11],
]
student_data_columns = ['student_id', 'name', 'age']
import pandas as pd
df = pd.DataFrame(data=student_data, columns=student_data_columns)
df

   student_id     name  age
0         101  Ulysses   13
1          53  William   10
2         128    Henry    6
3           3    Henry   11

to select a specifc column from our df we can do df['name_of_column']

In [13]:
df['student_id']

0    101
1     53
2    128
3      3
Name: student_id, dtype: int64

In [15]:
df['student_id'] == 101

0     True
1    False
2    False
3    False
Name: student_id, dtype: bool

In [19]:
df.loc[df['student_id'] == 101, ['name', 'age']]

      name  age
0  Ulysses   13

first argument, df['student_id'] == 101 is the condition you want to filter by
second argument, ['name', 'age'] is columns that you want to display

create a new column in 'student_data' DataFrame called 'age_in_dog_years'
for the values of 'age_in_dog_years', multiply 'age' by 7.5

In [21]:
df

   student_id     name  age
0         101  Ulysses   13
1          53  William   10
2         128    Henry    6
3           3    Henry   11

In [23]:
df['age']

0    13
1    10
2     6
3    11
Name: age, dtype: int64

In [25]:
df['age_in_dog_years'] = df['age'] * 7.5

In [27]:
df

   student_id     name  age  age_in_dog_years
0         101  Ulysses   13              97.5
1          53  William   10              75.0
2         128    Henry    6              45.0
3           3    Henry   11              82.5